import re

BAD_WORDS = [
    "хуй", "хуйня", "пизда", "пиздец", "ебать", "ебан", "ебло", "еблан",
    "манда", "мандавошка", "гандон", "придурок", "сука", "сучка",
    "блять", "блядь", "бля", "блядина", "пидор", "пидорас", "педераст",
    "хуесос", "хуеплет", "хуила", "залупа", "мудила", "мразь",
    "долбоеб", "дебил", "уебок", "наеб", "наебка", "охуел", "охуевший",
    "выеб", "выебал", "выебать", "ебись", "ебучий", "ебучка", "ебашить",
    "выебон", "ебейший", "ебанутый", "заебал", "заебись", "хуярить",
    "похуй", "нихуя", "нихрена", "соси", "анус", "петух", "шалава",
    "проститутка", "дрочить", "дрочер", "дрочка", "дрянь", "тварь",
    "мразота", "гнида", "ебырь", "блядовать", "мудак", "падла", "негр",
    "свинья", "анальный", "анал", "извращенец", "вагина", "сперма",
    "кончить", "конченный", "изнасиловать", "насрать", "обосрался",
    "какашка", "ссанина", "моча", "сиськи", "соска", "дебилка", "тупой", "тупая", "сосал?", "сосал"
]

BAD_PATTERNS = [
    r"\b[бвb][лl1@*]{1,2}[яаa4дdтt]{1,2}[ьъ]?\b",
    r"\b[пp][и1!]{0,1}[з3zсc][дdt]{1,2}[аa]\b",
    r"\b[хxх][уy*]{1,2}[йиия]\b",
    r"\b[еeё6][бbпp][аaооуyеe]{0,3}[тнмл]?\b",
    r"\b[гg][аa@][нn][дd][оo0][нn]\b",
    r"\b[сc][уy@][ккc][аa]\b",
    r"\b[мm][аa@][нn][дd][аaоо]\b",
    r"\b[пp][и1!]{0,1}[дdт][оoаa][рp][аaсc]\b",
    r"\b[дd][оoаa][лl1][бb6][оoаaеeё][еeё][бb]\b"
]

compiled_bad_patterns = [re.compile(p, re.IGNORECASE) for p in BAD_PATTERNS]


def is_valid_name(text: str) -> bool:
    text = text.strip().lower()

    # Только буквы, тире и пробелы
    if not re.fullmatch(r"[а-яёa-z\s\-]{2,50}", text, re.IGNORECASE):
        return False

    for bad in BAD_WORDS:
        if bad in text:
            return False

    for pattern in compiled_bad_patterns:
        if pattern.search(text):
            return False

    return True
